programming/java/code/beginning/10.html

<div id="outline-container-org491a353" class="outline-2">
<h2 id="org491a353"><code>PrimesToFile2.java</code></h2>
<div class="outline-text-2" id="text-org491a353">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">lang</span>.Math.<span style="color: #0072b2; font-weight: bold;">ceil</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">lang</span>.Math.<span style="color: #0072b2; font-weight: bold;">sqrt</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">File</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>;
<span class="linenr"> 7: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">IOException</span>;
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">ByteBuffer</span>;
<span class="linenr"> 9: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">CharBuffer</span>;
<span class="linenr">10: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">DoubleBuffer</span>;
<span class="linenr">11: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">LongBuffer</span>;
<span class="linenr">12: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #d55e00; font-weight: bold;">channels</span>.<span style="color: #0072b2; font-weight: bold;">FileChannel</span>;
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">PrimesToFile2</span> {
<span class="linenr">15: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">primesRequired</span> = 100; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Default count</span>
<span class="linenr">17: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (args.length &gt; 0) {
<span class="linenr">18: </span>      <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">19: </span>        primesRequired = Integer.valueOf(args[0]).intValue();
<span class="linenr">20: </span>      } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">NumberFormatException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">21: </span>        System.out.println(<span style="color: #848ea9;">"Prime count value invalid. Using default of "</span> + primesRequired);
<span class="linenr">22: </span>      }
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #0072b2; font-weight: bold;">long</span>[] <span style="color: #e69f00; font-weight: bold;">primes</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">long</span>[primesRequired]; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Array to store primes</span>
<span class="linenr">26: </span>    primes[0] = 2; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Seed the first prime</span>
<span class="linenr">27: </span>    primes[1] = 3; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">and the second</span>
<span class="linenr">28: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span> = 2; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Count of primes found - up to now, which is also the array index</span>
<span class="linenr">29: </span>    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">number</span> = 5; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Next integer to be tested</span>
<span class="linenr">30: </span>
<span class="linenr">31: </span>    <span style="color: #d55e00; font-weight: bold;">outer</span>:
<span class="linenr">32: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (; count &lt; <span style="color: #0072b2; font-weight: bold;">primesRequired</span>; number += 2) {
<span class="linenr">33: </span>
<span class="linenr">34: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The maximum divisor we need to try is square root of number</span>
<span class="linenr">35: </span>      <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">limit</span> = (<span style="color: #0072b2; font-weight: bold;">long</span>) ceil(sqrt((<span style="color: #0072b2; font-weight: bold;">double</span>) number));
<span class="linenr">36: </span>
<span class="linenr">37: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Divide by all the primes we have up to limit</span>
<span class="linenr">38: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 1; i &lt; <span style="color: #0072b2; font-weight: bold;">count</span> &amp;&amp; primes[i] &lt;= limit; i++)
<span class="linenr">39: </span>        <span style="color: #56b4e9; font-weight: bold;">if</span> (number % primes[i] == 0) <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Is it an exact divisor?</span>
<span class="linenr">40: </span>        <span style="color: #56b4e9; font-weight: bold;">continue</span> <span style="color: #d55e00; font-weight: bold;">outer</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">yes, try the next number</span>
<span class="linenr">41: </span>
<span class="linenr">42: </span>      primes[count++] = number; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">We got one!</span>
<span class="linenr">43: </span>    }
<span class="linenr">44: </span>
<span class="linenr">45: </span>    <span style="color: #0072b2; font-weight: bold;">File</span> <span style="color: #e69f00; font-weight: bold;">aFile</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">File</span>(<span style="color: #848ea9;">"/tmp/primes1.txt"</span>);
<span class="linenr">46: </span>    <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span> <span style="color: #e69f00; font-weight: bold;">outputFile</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">47: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">48: </span>      outputFile = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>(aFile);
<span class="linenr">49: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">50: </span>      e.printStackTrace(System.err);
<span class="linenr">51: </span>      System.exit(1);
<span class="linenr">52: </span>    }
<span class="linenr">53: </span>    <span style="color: #0072b2; font-weight: bold;">FileChannel</span> <span style="color: #e69f00; font-weight: bold;">file</span> = outputFile.getChannel();
<span class="linenr">54: </span>    <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">BUFFERSIZE</span> = 100; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Buffer size in bytes</span>
<span class="linenr">55: </span>    <span style="color: #0072b2; font-weight: bold;">ByteBuffer</span> <span style="color: #e69f00; font-weight: bold;">buf</span> = ByteBuffer.allocate(BUFFERSIZE);
<span class="linenr">56: </span>
<span class="linenr">57: </span>    <span style="color: #0072b2; font-weight: bold;">DoubleBuffer</span> <span style="color: #e69f00; font-weight: bold;">doubleBuf</span> = buf.asDoubleBuffer();
<span class="linenr">58: </span>    buf.position(8);
<span class="linenr">59: </span>    <span style="color: #0072b2; font-weight: bold;">CharBuffer</span> <span style="color: #e69f00; font-weight: bold;">charBuf</span> = buf.asCharBuffer();
<span class="linenr">60: </span>    <span style="color: #0072b2; font-weight: bold;">LongBuffer</span> <span style="color: #e69f00; font-weight: bold;">longBuf</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">61: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">primeStr</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">62: </span>
<span class="linenr">63: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">prime</span> : primes) {
<span class="linenr">64: </span>      primeStr = <span style="color: #848ea9;">"prime = "</span> + prime; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create the string</span>
<span class="linenr">65: </span>      doubleBuf.put(0, (<span style="color: #0072b2; font-weight: bold;">double</span>) primeStr.length()); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Store the string length</span>
<span class="linenr">66: </span>      charBuf.put(primeStr); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Store the string</span>
<span class="linenr">67: </span>      buf.position(2 * charBuf.position() + 8); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Position for 3rd buffer</span>
<span class="linenr">68: </span>      longBuf = buf.asLongBuffer(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create the buffer</span>
<span class="linenr">69: </span>      longBuf.put(prime); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Store the binary long value</span>
<span class="linenr">70: </span>      buf.position(buf.position() + 8); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Set position after last value</span>
<span class="linenr">71: </span>      buf.flip(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">and flip</span>
<span class="linenr">72: </span>      <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">73: </span>        file.write(buf); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Write the buffer as before.</span>
<span class="linenr">74: </span>      } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">75: </span>        e.printStackTrace(System.err);
<span class="linenr">76: </span>        System.exit(1);
<span class="linenr">77: </span>      }
<span class="linenr">78: </span>      buf.clear();
<span class="linenr">79: </span>      doubleBuf.clear();
<span class="linenr">80: </span>      charBuf.clear();
<span class="linenr">81: </span>    }
<span class="linenr">82: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">83: </span>      System.out.println(<span style="color: #848ea9;">"File written is "</span> + file.size() + <span style="color: #848ea9;">" bytes."</span>);
<span class="linenr">84: </span>      outputFile.close(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Close the file and its channel</span>
<span class="linenr">85: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">86: </span>      e.printStackTrace(System.err);
<span class="linenr">87: </span>      System.exit(1);
<span class="linenr">88: </span>    }
<span class="linenr">89: </span>    System.exit(0);
<span class="linenr">90: </span>  }
<span class="linenr">91: </span>}
</pre>
</div>
</div>
</div>
