programming/java/code/beginning/10.html

<div id="outline-container-org0f662c6" class="outline-2">
<h2 id="org0f662c6"><code>WriteAStringAsBytes.java</code></h2>
<div class="outline-text-2" id="text-org0f662c6">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">File</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">IOException</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">ByteBuffer</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #d55e00; font-weight: bold;">channels</span>.<span style="color: #0072b2; font-weight: bold;">FileChannel</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">WriteAStringAsBytes</span> {
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">phrase</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(<span style="color: #848ea9;">"Garbage in, garbage out\n"</span>);
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">dirname</span> = <span style="color: #848ea9;">"C:/Beg Java Stuff"</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Directory name</span>
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">filename</span> = <span style="color: #848ea9;">"byteData.txt"</span>;
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">File</span> <span style="color: #e69f00; font-weight: bold;">aFile</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">File</span>(dirname, filename);
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create the file output stream</span>
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span> <span style="color: #e69f00; font-weight: bold;">file</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">20: </span>      file = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>(aFile, <span style="color: #d55e00; font-weight: bold;">true</span>);
<span class="linenr">21: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">22: </span>      e.printStackTrace(System.err);
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">FileChannel</span> <span style="color: #e69f00; font-weight: bold;">outChannel</span> = file.getChannel();
<span class="linenr">25: </span>    <span style="color: #0072b2; font-weight: bold;">ByteBuffer</span> <span style="color: #e69f00; font-weight: bold;">buf</span> = ByteBuffer.allocate(phrase.length());
<span class="linenr">26: </span>    <span style="color: #0072b2; font-weight: bold;">byte</span>[] <span style="color: #e69f00; font-weight: bold;">bytes</span> = phrase.getBytes();
<span class="linenr">27: </span>    buf.put(bytes);
<span class="linenr">28: </span>    buf.flip();
<span class="linenr">29: </span>
<span class="linenr">30: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">31: </span>      outChannel.write(buf);
<span class="linenr">32: </span>      file.close(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Close the output stream &amp; the channel</span>
<span class="linenr">33: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">34: </span>      e.printStackTrace(System.err);
<span class="linenr">35: </span>    }
<span class="linenr">36: </span>  }
<span class="linenr">37: </span>}
</pre>
</div>
</div>
</div>
