programming/java/code/beginning/10.html

<div id="outline-container-org92e4133" class="outline-2">
<h2 id="org92e4133"><code>WriteProverbs.java</code></h2>
<div class="outline-text-2" id="text-org92e4133">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">File</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">io</span>.<span style="color: #0072b2; font-weight: bold;">IOException</span>;
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #0072b2; font-weight: bold;">ByteBuffer</span>;
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">nio</span>.<span style="color: #d55e00; font-weight: bold;">channels</span>.<span style="color: #0072b2; font-weight: bold;">FileChannel</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">WriteProverbs</span> {
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">dirName</span> = <span style="color: #848ea9;">"/tmp"</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Directory for the output file</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">fileName</span> = <span style="color: #848ea9;">"Proverbs.txt"</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Name of the output file</span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">sayings</span> = {
<span class="linenr">13: </span>      <span style="color: #848ea9;">"Indecision maximizes flexibility."</span>,
<span class="linenr">14: </span>      <span style="color: #848ea9;">"Only the mediocre are always at their best."</span>,
<span class="linenr">15: </span>      <span style="color: #848ea9;">"A little knowledge is a dangerous thing."</span>,
<span class="linenr">16: </span>      <span style="color: #848ea9;">"Many a mickle makes a muckle."</span>,
<span class="linenr">17: </span>      <span style="color: #848ea9;">"Who begins too much achieves little."</span>,
<span class="linenr">18: </span>      <span style="color: #848ea9;">"Who knows most says least."</span>,
<span class="linenr">19: </span>      <span style="color: #848ea9;">"A wise man sits on the hole in his carpet."</span>
<span class="linenr">20: </span>    };
<span class="linenr">21: </span>    <span style="color: #0072b2; font-weight: bold;">File</span> <span style="color: #e69f00; font-weight: bold;">aFile</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">File</span>(dirName, fileName);
<span class="linenr">22: </span>
<span class="linenr">23: </span>    <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span> <span style="color: #e69f00; font-weight: bold;">outputFile</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">24: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">25: </span>      outputFile = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">FileOutputStream</span>(aFile, <span style="color: #d55e00; font-weight: bold;">true</span>);
<span class="linenr">26: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">FileNotFoundException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">27: </span>      e.printStackTrace(System.err);
<span class="linenr">28: </span>      System.exit(1);
<span class="linenr">29: </span>    }
<span class="linenr">30: </span>    <span style="color: #0072b2; font-weight: bold;">FileChannel</span> <span style="color: #e69f00; font-weight: bold;">outChannel</span> = outputFile.getChannel();
<span class="linenr">31: </span>
<span class="linenr">32: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create a buffer to accommodate the longest string + its length value</span>
<span class="linenr">33: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxLength</span> = 0;
<span class="linenr">34: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">saying</span> : sayings) {
<span class="linenr">35: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (maxLength &lt; saying.<span style="color: #0072b2; font-weight: bold;">length</span>()) maxLength = saying.length();
<span class="linenr">36: </span>    }
<span class="linenr">37: </span>
<span class="linenr">38: </span>    <span style="color: #0072b2; font-weight: bold;">ByteBuffer</span> <span style="color: #e69f00; font-weight: bold;">buf</span> = ByteBuffer.allocate(2 * maxLength + 4);
<span class="linenr">39: </span>
<span class="linenr">40: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Write the file</span>
<span class="linenr">41: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">42: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">saying</span> : sayings) {
<span class="linenr">43: </span>        buf.putInt(saying.length()).asCharBuffer().put(saying);
<span class="linenr">44: </span>        buf.position(buf.position() + 2 * saying.length()).flip();
<span class="linenr">45: </span>        outChannel.write(buf); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Write the buffer to the file channel</span>
<span class="linenr">46: </span>        buf.clear();
<span class="linenr">47: </span>      }
<span class="linenr">48: </span>      outputFile.close(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Close the output stream &amp; the channel</span>
<span class="linenr">49: </span>      System.out.println(<span style="color: #848ea9;">"Proverbs written to file."</span>);
<span class="linenr">50: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">IOException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">51: </span>      e.printStackTrace(System.err);
<span class="linenr">52: </span>      System.exit(1);
<span class="linenr">53: </span>    }
<span class="linenr">54: </span>    System.exit(0);
<span class="linenr">55: </span>  }
<span class="linenr">56: </span>}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
